In [1]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%config SqlMagic.displaycon = False

In [2]:
%load_ext sql

In [3]:
server = 'DESKTOP-5KNVBQE\\SQLEXPRESS'
database = 'Bank'
port = '1433'

connection_url = f"mssql+pyodbc://@{server},{port}/{database}?driver=ODBC+Driver+17+for+SQL+Server&trusted_connection=yes"

# Connect using %sql
%sql $connection_url

# Part 1 — Understanding the Dataset (Basic Exploration)

### Retrieve all columns for the first 20 customers.

In [4]:
%%sql

select top(20) *
from Bank_customers

Done.

[(59, 'admin.', 'married', 'secondary', 'no', 2343, 'yes', 'no', 'unknown', 5, 'may', 1042, 1, -1, 0, 'unknown', 'yes'),
 (56, 'admin.', 'married', 'secondary', 'no', 45, 'no', 'no', 'unknown', 5, 'may', 1467, 1, -1, 0, 'unknown', 'yes'),
 (41, 'technician', 'married', 'secondary', 'no', 1270, 'yes', 'no', 'unknown', 5, 'may', 1389, 1, -1, 0, 'unknown', 'yes'),
 (55, 'services', 'married', 'secondary', 'no', 2476, 'yes', 'no', 'unknown', 5, 'may', 579, 1, -1, 0, 'unknown', 'yes'),
 (54, 'admin.', 'married', 'tertiary', 'no', 184, 'no', 'no', 'unknown', 5, 'may', 673, 2, -1, 0, 'unknown', 'yes'),
 (42, 'management', 'single', 'tertiary', 'no', 0, 'yes', 'yes', 'unknown', 5, 'may', 562, 2, -1, 0, 'unknown', 'yes'),
 (56, 'management', 'married', 'tertiary', 'no', 830, 'yes', 'yes', 'unknown', 6, 'may', 1201, 1, -1, 0, 'unknown', 'yes'),
 (60, 'retired', 'divorced', 'secondary', 'no', 545, 'yes', 'no', 'unknown', 6, 'may', 1030, 1, -1, 0, 'unknown', 'yes'),
 (37, 'technician', 'married', 'secondary', 'no', 1, 'yes', 'no', 'unknown', 6, 'may', 608, 1, -1, 0, 'unknown', 'yes'),
 (28, 'services', 'single', 'secondary', 'no', 5090, 'yes', 'no', 'unknown', 6, 'may', 1297, 3, -1, 0, 'unknown', 'yes'),
 (38, 'admin.', 'single', 'secondary', 'no', 100, 'yes', 'no', 'unknown', 7, 'may', 786, 1, -1, 0, 'unknown', 'yes'),
 (30, 'blue-collar', 'married', 'secondary', 'no', 309, 'yes', 'no', 'unknown', 7, 'may', 1574, 2, -1, 0, 'unknown', 'yes'),
 (29, 'management', 'married', 'tertiary', 'no', 199, 'yes', 'yes', 'unknown', 7, 'may', 1689, 4, -1, 0, 'unknown', 'yes'),
 (46, 'blue-collar', 'single', 'tertiary', 'no', 460, 'yes', 'no', 'unknown', 7, 'may', 1102, 2, -1, 0, 'unknown', 'yes'),
 (31, 'technician', 'single', 'tertiary', 'no', 703, 'yes', 'no', 'unknown', 8, 'may', 943, 2, -1, 0, 'unknown', 'yes'),
 (35, 'management', 'divorced', 'tertiary', 'no', 3837, 'yes', 'no', 'unknown', 8, 'may', 1084, 1, -1, 0, 'unknown', 'yes'),
 (32, 'blue-collar', 'single', 'primary', 'no', 611, 'yes', 'no', 'unknown', 8, 'may', 541, 3, -1, 0, 'unknown', 'yes'),
 (49, 'services', 'married', 'secondary', 'no', -8, 'yes', 'no', 'unknown', 8, 'may', 1119, 1, -1, 0, 'unknown', 'yes'),
 (41, 'admin.', 'married', 'secondary', 'no', 55, 'yes', 'no', 'unknown', 8, 'may', 1120, 2, -1, 0, 'unknown', 'yes'),
 (49, 'admin.', 'divorced', 'secondary', 'no', 168, 'yes', 'yes', 'unknown', 8, 'may', 513, 1, -1, 0, 'unknown', 'yes')]

### Count the total number of records in the dataset.

In [5]:
%%sql

select count(age) as count_records
from Bank_customers

Done.

[(11162,)]

### List all unique job categories.

In [6]:
%%sql

select distinct job
from Bank_customers

Done.

[('technician',),
 ('services',),
 ('housemaid',),
 ('retired',),
 ('blue-collar',),
 ('unknown',),
 ('self-employed',),
 ('student',),
 ('unemployed',),
 ('entrepreneur',),
 ('admin.',),
 ('management',)]

### Count how many customers belong to each job category.

In [7]:
%%sql

select job, count(job) as customers_count
from Bank_customers
group by job

Done.

[('technician', 1823),
 ('services', 923),
 ('housemaid', 274),
 ('retired', 778),
 ('blue-collar', 1944),
 ('unknown', 70),
 ('self-employed', 405),
 ('student', 360),
 ('unemployed', 357),
 ('entrepreneur', 328),
 ('admin.', 1334),
 ('management', 2566)]

### Show the minimum, maximum, and average age.

In [8]:
%%sql

select min(age) as minimum_ag, max(age) as maximum_ag, avg(age) as avg_age
from Bank_customers

Done.

[(18, 95, 41)]

# Part 2 - Customer Demographics Analysis

### Find the average age for each educational level.

In [9]:
%%sql

select education, avg(age) as avg_age
from Bank_customers
group by education

Done.

[('unknown', 45), ('tertiary', 39), ('secondary', 40), ('primary', 48)]

### Count how many customers are married, single, or divorced.

In [10]:
%%sql

select marital as marital_status, count(marital) as count_customers
from Bank_customers
group by marital

Done.

[('single', 3518), ('divorced', 1293), ('married', 6351)]

### Retrieve the top 10 customers with the highest account balance.

In [11]:
%%sql

select top(10) *
from Bank_customers
order by balance desc

Done.

[(84, 'retired', 'married', 'secondary', 'no', 81204, 'no', 'no', 'telephone', 28, 'dec', 679, 1, 313, 2, 'other', 'yes'),
 (84, 'retired', 'married', 'secondary', 'no', 81204, 'no', 'no', 'telephone', 1, 'apr', 390, 1, 94, 3, 'success', 'yes'),
 (52, 'blue-collar', 'married', 'primary', 'no', 66653, 'no', 'no', 'cellular', 14, 'aug', 109, 3, -1, 0, 'unknown', 'no'),
 (43, 'admin.', 'single', 'secondary', 'no', 56831, 'no', 'no', 'unknown', 15, 'may', 243, 1, -1, 0, 'unknown', 'no'),
 (61, 'self-employed', 'divorced', 'tertiary', 'no', 52587, 'no', 'no', 'cellular', 10, 'aug', 290, 1, -1, 0, 'unknown', 'yes'),
 (61, 'self-employed', 'divorced', 'tertiary', 'no', 52587, 'no', 'no', 'cellular', 15, 'feb', 394, 3, 189, 1, 'success', 'yes'),
 (56, 'entrepreneur', 'married', 'tertiary', 'no', 51439, 'no', 'yes', 'cellular', 8, 'jul', 325, 1, -1, 0, 'unknown', 'no'),
 (39, 'technician', 'single', 'unknown', 'no', 45248, 'yes', 'no', 'unknown', 6, 'may', 1623, 1, -1, 0, 'unknown', 'yes'),
 (75, 'retired', 'divorced', 'primary', 'no', 37127, 'no', 'no', 'cellular', 11, 'feb', 505, 1, -1, 0, 'unknown', 'no'),
 (51, 'entrepreneur', 'married', 'tertiary', 'no', 36935, 'yes', 'no', 'cellular', 21, 'nov', 41, 1, -1, 0, 'unknown', 'no')]

### Calculate the average balance grouped by job.

In [12]:
%%sql

select job , avg(balance) as avg_balance
from Bank_customers
group by job

Done.

[('technician', 1556),
 ('services', 1081),
 ('housemaid', 1366),
 ('retired', 2417),
 ('blue-collar', 1203),
 ('unknown', 1945),
 ('self-employed', 1865),
 ('student', 1500),
 ('unemployed', 1314),
 ('entrepreneur', 1621),
 ('admin.', 1195),
 ('management', 1793)]

# Part 3 - Campaign Performance Analysis

### Count how many clients subscribed to the term deposit (y = 'yes') vs. not subscribed.

In [14]:
%%sql

select deposit, count(deposit) as count_customers
from Bank_customers
group by deposit

Done.

[('yes', 5289), ('no', 5873)]

### Which job category has the highest number of subscriptions?

In [ ]:
%%sql

select job, sum(case when deposit = 'yes' then 1 else 0 end) as num_of_subscriptions
from Bank_customers
group by job
order by 2 desc

Done.

[('management', 1301),
 ('technician', 840),
 ('blue-collar', 708),
 ('admin.', 631),
 ('retired', 516),
 ('services', 369),
 ('student', 269),
 ('unemployed', 202),
 ('self-employed', 187),
 ('entrepreneur', 123),
 ('housemaid', 109),
 ('unknown', 34)]

management has the highest number of subscriptions

### Which marital status produced the highest subscription rate?

In [23]:
%%sql

select marital as marital_status, sum(case when deposit = 'yes' then 1 else 0 end) as num_of_subscriptions
from Bank_customers
group by marital
order by 2 desc

Done.

[('married', 2755), ('single', 1912), ('divorced', 622)]

married has the highest number of subscriptions

# Part 4 — Previous Campaign Analysis

### Count how many customers were previously contacted (previous > 0).

In [24]:
%%sql

select sum(case when previous > 0 then 1 else 0 end) as contacted_customers
from Bank_customers

Done.

[(2838,)]

### Analyse subscription success for customers who were contacted before vs. first-timers.

In [35]:
%%sql

with contact_summary as (
    select 
        case when previous > 0 then 'contacted' else 'not_contacted' end as contact_status,
        case when deposit = 'yes' then 1 else 0 end as num_of_subscriptions
    from Bank_customers
)

select contact_status, sum(num_of_subscriptions) as num_of_subscriptions
from contact_summary
group by contact_status

Done.

[('not_contacted', 3384), ('contacted', 1905)]

### Evaluate subscription success grouped by the previous campaign outcome (poutcome).

In [36]:
%%sql

select poutcome, sum(case when deposit = 'yes' then 1 else 0 end) as num_of_subscriptions
from Bank_customers
group by poutcome
order by 2 desc

Done.

[('unknown', 3386), ('success', 978), ('failure', 618), ('other', 307)]